# `get_posts_all()` – возвращает посты
#
# `get_posts_by_user(user_name)` – возвращает посты определенного пользователя
#
# `get_comments_by_post_id(post_id)` – возвращает комментарии определенного поста
#
# `search_for_posts(query)` – возвращает список словарей по вхождению query
#
# `get_post_by_pk(pk)` – возвращает один пост по его идентификатору
#
# Напишите к каждой функции юнит тесты, расположите тесты в отдельной папке `/tests`.
#
# Организуйте тесты в виде классов или функций, на ваше усмотрение.

